//  ARRAY

let x =  1 // можно сохранять только 1 информацию
x = true // полностью поменял x = 1 на true таким образом всё содержимое утеряно
//  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
// Array - List - Массив
// может держать несколько информаций в одном месте
// с помощью typeof()
let arr = [1,2,3, "a","b","c", [1, 2, 3]] // не имеет значения сколько информаций в одном листе
console.log(arr) 


//  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 

// что бы вырезать массив:
// let r = arr.slice(0,2)

//  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 

// что-бы взять букву с массива:
let t = arr[[1]]
let y = arr[[6][0]]

//  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 

// что-бы проверить является ли строка Array
let arr2 = [1, 2, 3, "a", "b", "c", [1, 2]]
Array.isArray(arr2)

//  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 

// ВСЕ  удаляют и сохраняют в оригинале

// Add - добавить в массив
arr2.push("end") // добавляет в конец массива
console.log(arr2) 

arr2.unshift("start") // добавляет в начало массива
console.log(arr2)

//  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 

// Delete - удалит с массива 
arr2.pop() // удаляет в конце массива
console.log(arr2)

arr.shift() // удаляет в начале массива
console.log(arr2)

//  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 

// DEL AND ADD
// arr.splice(starting index, what_to_delete, what_add_after_delete)

// let letters = ['a','b','c','d']
// letters.splice(1,1)
// letters.splice(2,2,2,2)
// letters.splice(2, 2+2 , 2)

// letters.splice(2, 1**999 , "1*999") // с 2 индекса начал, удалил 1 во 2 индексе, и добавил во 2 индекс string
// console.log(letters)

//  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 

// spreat

// let x = [1,2,3, "Kamron"]
// console.log(...x) // 1 2 3 - без массива 

//  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 

// let x = [1,2,3, "Kamron"]
// let y = [1,2,3, "Kamron"]
// let z = [1,2,3, "Kamron"]
// let = a [ ...x, ...y, ...z]
// console.log(a)

//  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 

// let words = ["Bob", "John", "Alex", "Mike","Tom"]
// let numbers = [23, 11, 5, 99, 1, 10]

// console.log(words.sort()) // ставит по алфавиту
// // console.log(numbers.sort()) // берет только первые цифры 
// console.log(numbers.sort((a, b) => a - b)) // используется что бы поставить по порядку цифры

//  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
