var name = "Иван Тургенев"
var q = "самых значимых русских"
var w = "XIX века."
var e = "художественная система"
var r = "поэтику романа как в "
var t = "России, "
var y = "рубежом"
var u = "восхваляли и жестко критиковали,"
var i = "Тургенев всю жизнь"
var o = "путь, который привел"
var p = "из старинного"
var a = "рода тульских дворян"
var s = "полку и "
var d = " весьма расточительный образ жизни." 
var f = "поправки финансового"
var g = "положения он вынужден"
var h = "жениться на"
var j = "(по меркам того времени),"
var k = "состоятельной помещице" 
var l = "Варваре Лутовиновой."
var z = "Брак стал для них"
var x = "их отношения не "
var c = "Их второй сын,"
var v = "Иван"
var b = "1818 году"
var n = "Мать"
var m = "«…в понедельник"
var qw = "Иван,"
var er = "ростом 12 "
var ty = "[примерно 53 сантиметра]»"
var ui = "детей в"
var op = "Тургеневых было"
var as = "Николай, Иван и Сергей."
var df = "До девяти"
var gh = "Тургенев жил в "
var jk = "Спасское-Лутовиново"
var lz = "Орловской области"
var xc = "матери был непростой"
var vb = "искренняя и сердечная"
var nm = "забота"
var qwe = "детях сочеталась с суровым"
var rty = "Варвара Тургенева"
var uio = "Однако она приглашала "
var pas = "детям"
var dfg = "французских"
var hjk = "немецких гувернеров"
var lzx = "сыновьями исключительно"
var cvb = "по-французски,"
var nmq = "Николая Карамзина"
var qa = "Василия Жуковского"
let name1 = "Александра Пушкина"
let q1 = "Николая Гоголя"
let w1 = "В 1827 году"
let e1 = "Тургеневы переехали"
let r1 = "Москву"
let t1 = "Спустя три"
let y1 = "Сергей Тургенев"
let u1 = "Ивану Тургеневу было 15"
let i1 = "он поступил"
let o1 = "словесный "
let p1 = "Московского университета"
let a1 = "писатель впервые"
let s1 = " в княжну Екатерину Шаховскую"
let d1 = "Шаховская обменивалась "
let f1 = "письмами"
let g1 = "ответила взаимностью"
let h1 = "Тургенева"
let j1= "его сердце"
let k1 = "Позже"
let l1 = "история стала основой"
let z1 = "Тургенева"
let x1 = "«Первая любовь»"
let c1 = "Через год Сергей Тургенев"
let v1 = "скончался"
let b1 = "Варвара с детьми переехала"
let n1 = "Петербург"
let m1 = "Тургенев"
let qw1 = "Тогда он серьезно увлекся"
let er1 = "и написал первое"
let ty1 = "драматическую поэму"
let ui1 = "«Стенo»"
let op1 = "Тургенев отзывался "
let as1 = "«Совершенно нелепое произведение,"
const  q2= "в котором с бешеною"
const  w2= "рабское подражание"
const  e2= "Манфреду»"
const  r2= "Тургенев"
const  t2= "неумелостью выражалос"
const  y2= "стихотворений и несколько поэм."
const  u2= "Некоторые его стихи опубликовал"
const  i2= "«Современник»."
const  o2= "Всего за годы учебы"
const  p2= "После учебы 20-летний"
const  a2= "Тургенев отправился"
const  s2= "Европу"
const  d2= "образование"
const  f2= "Он изучал античных классиков,"
const  g2= "литературу, путешествовал "
const  h2= "Франции"
const  j2= "Голландии"
const  k2= "Италии. Европейский уклад жизни поразил Тургенева: он пришел к выводу, что Россия "

console.log(`
${name} был одним из ${q} писателей ${w} Созданная им  ${e} изменила ${r} 

${t} так и за ${y}. Его произведения ${u} а ${i} искал в них ${o}

Семья ${name} происходила ${p} ${a}. Его отец, ${name}, служил в кавалергардском ${s}


вел ${d} Для  ${f} ${g}  был ${h} немолодой ${j}
 но очень${k}  ${l} ${z} обоих несчастливым,${x} складывались.${c} 

  ${v}, родился спустя два года после свадьбы, в ${b}1818 году, в Орле. ${n} записала в своем дневнике: ${m} родился сын ${qw} 

  ${er}вершков ${ty}. Всего ${ui} семье ${op}Тургеневых было трое: ${as}


  ${df} лет ${gh} имении ${jk} в ${lz}. У его ${xc} и противоречивый характер:
 ее ${vb} ${nm} о ${qwe} деспотизмом,${rty} нередко била сыновей. ${uio}

 к ${pas} лучших ${dfg} и ${hjk}, говорила с ${lzx}сыновьями исключительно ${cvb}по-французски, но при этом оставалась поклонницей 

 русской литературы и читала ${nmq}, ${qa}Василия Жуковского, ${name1} и ${q1}.

 ${w1} ${e1} в ${r1}, чтобы дети смогли получить лучшее образование.${t1} Спустя три года ${y1} ушел из семьи.


Когда ${u1} лет, ${i1} на ${o1}факультет ${p1}. Тогда же будущий ${a1} 

влюбился ${s1}. ${d1}с ним ${f1}, но ${g1} отцу ${h1}Тургенева и тем самым разбила

${j1}. ${k1}Позже эта ${l1} повести ${z1}Тургенева ${x1}.
${c1} ${v1}, ${b1}и в ${n1}, где ${m1} поступил в Петербургский университет на 

философский факультет.${qw1} лирикой ${er1} произведение — ${ty1}  ${ui1}. ${op1}
о ней так: ${as1} ${q2}${t2}ь ${w2} байроновскому ${e2}. 

${o2} ${r2}Тургенев написал около сотни ${y2} ${u2}Некоторые его стихи опубликовал журнал ${i2}«Современник».

${p2} ${a2} в ${s2}, чтобы продолжить ${d2}. ${f2} римскую и греческую 

${g2}по ${h2}Франции, ${j2}Голландии, ${k2}
`
)