// console.log("Hello world")   // string
// console.warn("Hello world")  // string
// console.error("Hello world") // string

// 3 вида ковычек "", '', '' .
// console.log("This is 'ME'")

//  - - - -   - - - -   - - - -   - - - -   - - - -   - - - -  

// 1. String - тип данных, который даёт текст
// 2. Number - тип данных, который даёт цифры
// 3. Bigint - больше 17 цифр он не понимает поэтому нужен bigint
// 4. Boolean = true/false (истина/ложь)
// 5. Undefined - не определённость (если есть ящик но он пустой)
// 6. Null - пусто (когда хотим сами)
// 7. Symbol - символы
// 8. Object - любой объект 

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// "use strict" - формальный вид программирования

// fruits = "Orange, Banana, Apple ..." // не формальный вид...
// console.log(fruits)

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// var = fruits = "Orange, Banana, Apple ..." - Глобальный, может работать везде, внутри - снаружи блока - можно обновить название
// console.log(fruits)

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// {
// let = fruits = "Orange, Banana, Apple ..." - Локальный, не может работать ВНЕ БЛОКА КОДА - можно обновить название
// }
// console.log(fruits) - нельзя вызвать ВНЕ БЛОКА КОДА- выдаст ошибку

// Объяснение: В доме есть кондиционер, он не может быть использован вне комнаты 

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// const = fruits = "Orange, Banana, Apple ..." - ЛОКАЛЬНЫЕ, могут зайти в дом но не могут выйти, нельзя изменить, только 1 название!
// console.log(fruits)

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// VARIABLES 
// var x = "Var test"
// let z = "Let test"
// const y = "Const test"

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// {
//     {
//         var x = " ...Var "
//         z = " ...Let "
//     }
// }

// y = "..."
// console.log(y)

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// - - - SYNTAX  - - -
// keyword variables-name = value
// ключевое-слово имя-переменной = значение

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// let test = "My test text"
// console.log("This is: " + test)

// let test = "My test text"
// console.log(`This is: ${test}`) - наклонные ковычки нужны для того что бы вставить переменную в string

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// console.log(`
// This is 
// test test
// from AC!!!
// `)

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// Домашнее задание - информация о себе - для каждого типа по 50 переменных 

// let myName = "Alex"
// let myAge = "32"
// console.log(`

// My name is ${myName}.
// I am ${myAge} years old.

// `)

// var x = - использовать много где
// let x = иногда обновлять x = "..."
// const = использовать только 1 раз









