// 1. Напишите функцию JavaScript, чтобы проверить, является ли вход массивом или нет.
let a = [1, 2, 3]
console.log(Array.isArray(a))

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 2. Напишите функцию JavaScript для клонирования массива.

let z = [1,2,3,4,5]
console.log(z.slice())

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 3. Напишите функцию JavaScript для получения первого элемента массива.
// Передача параметра n вернет первые n элементов массива.

let arr = [7, 9, 0, -2]
let n = 4
let result = n >= 0 ? arr.slice(0, n) : []
console.log(result)

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 4. Напишите функцию JavaScript для получения последнего элемента массива.
// Передача параметра n вернет последние n элементов массива.

let arr2 = [7, 9, 0, -2]
let n2 = 1
let result2 = n2 >= 0 ? arr.slice(n2) : []
console.log(result2)

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 5. Напишите простую программу на JavaScript, которая объединит все элементы следующего массива в строку.
// Пример массива: myColor = ["Красный", "Зеленый", "Белый", "Черный"]
// Ожидаемый результат:
// «Красный, Зеленый, Белый, Черный»
// «Красный+Зеленый+Белый+Черный»

let myColor = ["Красный", "Зеленый", "Белый", "Черный"]

let result4 = myColor.join(", ")
let result5 = myColor.join("+")

console.log(result4)
console.log(result5)

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 6. Напишите программу на JavaScript, которая принимает число в качестве входных данных 
// и вставляет тире (-) между каждым четным числом. Например, если вы принимаете 025468, 
// результат должен быть 0-254-6-8.

let number = "025468"
let result6 = ""

result6 = number.split("").join("-")

console.log(result6)

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 7. Напишите программу на JavaScript для сортировки элементов массива.
// Пример массива: var arr1 = [-3, 8, 7, 6, 5, -4, 3, 2, 1]
// Пример вывода: -4,-3,1,2,3,5,6,7,8

let arr1 = [-3, 8, 7, 6, 5, -4, 3, 2, 1]
let sort = arr1.sort((a,b) => {a,b})
console.log(sort)

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 9. Напишите программу на JavaScript, которая принимает строку в качестве входных данных 
// и меняет регистр каждого символа.
// Например, если вы введете «Быстрая коричневая лиса», на выходе должно быть «БЫСТРАЯ КОРИЧНЕВАЯ ЛИСА».

let c = "The Quick Brown Fox"
console.log(c.toUpperCase())

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 12. Напишите программу на JavaScript для вычисления суммы и произведения массива целых чисел.

let array = [1, 2, 3, 4, 5]

let res = array.reduce((acc, next) => {
    return acc + next
})
console.log('result:', res)

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 


// 13. Напишите программу на JavaScript для добавления элементов в пустой массив и их отображения.

let pustoy = []
console.log(pustoy)
pustoy.push(1)
pustoy.push(2)
pustoy.push(3)
console.log(pustoy)

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 14. Напишите программу на JavaScript для удаления повторяющихся элементов из массива (без учета регистра).
// цифры
let dupl = [1, 1, 2, 3, 3, 4, 5]
let set = new Set(dupl)
console.log(set)
// текст
let dup = ["A", "B", "A", "B"]
let change = dup.map(all => all.toUpperCase())
let set2 = new Set(change)
console.log(set2)

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 15. У нас есть следующие массивы :
// color = ["Blue ", "Green", "Red", "Orange", "Violet", "Indigo", "Yellow "]
// o = ["th","st","nd","rd"]
// Напишите программу на JavaScript для отображения цветов следующим образом.:
// "1st choice is Blue ."
// "2nd choice is Green."
// "3rd choice is Red."

let colors = ["Blue","Green","Red","Orange","Violet","Indigo","Yellow"]
let suffixes = ["th", "st", "nd", "rd"]

colors.forEach((value,index) => {
    let current = index + 1 // индекс считает не с 0 а с 1 
    let suffix = ""

    if(current > 3) { // тут индексы уже с 1 2 3 итд.. если больше 3 индекса(Orange) 
        suffix = suffixes[0] // все индексы больше 3 получают - th 
    } else { suffix = suffixes[current] } // тут получают - st, nd, rd - до 3 индекса 
    console.log( `${current+suffix} choise is ${value}` ) // current начался с 1 индекса - suffix принимает параметры с if else - value просто показывает значения
})  

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 22. Напишите программу на JavaScript для вычисления объединения двух массивов.

let arr8 = [1, 2, 3]
let arr9 = [100, 2, 1, 10]

let re = [...arr8, ...arr9]
console.log(re)

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 23. Напишите функцию JavaScript для поиска разницы между двумя массивами.

let z1 = [1, 2, 3]
let x1 = [100, 2, 1, 10]

let resul = []

z1.forEach(val => {
if (!x1.includes(val)) { // если значения нет в x1 он добавляет его в result
resul.push(val) }
})
x1.forEach(val => {
 if (!z1.includes(val)) {
    resul.push(val) }
})
console.log("Result: ", resul)

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 24. Напишите функцию JavaScript для удаления. Значения 'null', '0', '""', 'false', 'undefined' и 'NaN' из массива.

const arr0 = [NaN, 0, 15, false, -22, undefined, 47, null]
let result3 = arr0.filter((value) => { // работает с каждым и отделяет не нужное от нужного
    if (typeof(value) === 'number') // тут проверяется если это число то он проходит проверку - - - NaN - даёт number
        if (!isNaN(value) && value != 0) { // тут проверяет является ли значение числом, не является ли оно NaN и не равен 0 то он проходит проверку 
            console.log(value) // в итоге покажето только то что прошло все проверки а именно [15, -22, 47]
        }
})

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 28. Напишите функцию JavaScript для поиска самой длинной общей начальной подстроки в наборе строк.

let lon = ["first","second","thirddddd"] 
lon.sort((a, b) => b.length - a.length)
let r = lon[0]
console.log(r)

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 30. Напишите функцию JavaScript, которая объединяет два массива и удаляет все повторяющиеся элементы.

arr8 = [1, 2, 3]
arr9 = [100, 2, 1, 10]

re = [...arr8, ...arr9]

let result0 = new Set(re)

console.log(result0)

// = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = 

// 31. Напишите функцию JavaScript для удаления определенного элемента из массива.

let massiv = [1, 2, 3, 4, 5]
let k = 3
massiv = massiv.filter(value => value != k)
console.log(massiv)