let person = {
    name: "Ali",
    surname: "Veli",
    age: 25
}


// что такое цикл? - цикл это то что происходит повторно.
// что такое for - создаёт цикл.

// for (создать переменную; условие; изменить-переменную)

// for in - нужен больше для объектов
// for of - нужен для 


// for (let key in person) {
//     console.log("Key: ", key)
//     console.log("Value: ", person[key])
// }



// ЗАДАНИЕ - 1

// let numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

// let even = []

// for (let i = 0; i < numbers.length; i++) {
//     if (numbers[i] % 2 == 0) {
//         even.push(numbers[i])
//     }
// }
// console.log("evens: ", even)


// ЗАДАНИЕ - 2

// let result = ''
// for (let i= 0; )


// ЗАДАНИЕ - 3

// for (let x=1; x <= 10; x++) {
// console.log('*'.repeat(x+1))
// }

// output:
// *
// * *
// * * *
// * * * *
// * * * * *
// * * * * * *
// * * * * * * * 
// * * * * * * * *
// * * * * * * * * * 
// * * * * * * * * * * 

// ---------------------

//      *
//    * * *
//   * * * *
//  * * * * *

// ---------------------

// 1. Создайте функцию, которая принимает список чётных чисел и находит сумму всех четных чисел.

// function fun(array) {
//     let even = []
//     for (let i = 0; i < array.length; i++) {
//         if (array[i] % 2 === 0) {
//             even.push(array[i])
//         }
//     }
//     return even
// }

// console.log(fun([1, 2, 3, 4, 5, 6, 7, 8, 9, 10]))

// ---------------------

// 2. Создайте функцию, которая принимает список целых чисел и находит самое маленькое число
function max_min(nums) {
    let max = 0
    let min = num[0]
    for ()
}
// ---------------------
// 3. Создайте функцию, которая принимает список целых чисел и находит самое большое число
// ---------------------
// 4. Создайте функцию, которая 